import json
a = """{
    "username": null,
    "rooms": [
        {
            "rooms": 0,
            "min_price": 30000,
            "max_price": 40000
        },
        {
            "rooms": 1,
            "min_price": 30000,
            "max_price": 40000
        }
    ],
    "undergrounds": [
        "Бабушкинская", 
        "Алтуфьево", 
        "Владыкино", 
        "Дмитровская", 
        "Савеловская", 
        "Тимирязевская", 
        "Петровско-Разумовская", 
        "Лихоборы", 
        "Верхние Лихоборы", 
        "Окружная", 
        "Лианозово", 
        "Северное Медведково", 
        "Южное Медведково", 
        "Бибирево", 
        "Отрадное"
    ],
    "chat_id": null,
    "author_type": "Любой",
    "metro_dist": 1000,
    "sex": [
        "Мужчина🤵‍♂️",
        "Я один"
    ],
    "animal": [],
    "mates": [
        "Один сосед 🤼‍♂️"
    ],
    "period": "",
    "initial_price_value": 40000,
    "initial_undergrounds_value": [
        "Бабушкинская", 
        "Алтуфьево", 
        "Владыкино", 
        "Дмитровская", 
        "Савеловская", 
        "Тимирязевская", 
        "Петровско-Разумовская", 
        "Лихоборы", 
        "Верхние Лихоборы", 
        "Окружная", 
        "Лианозово", 
        "Северное Медведково", 
        "Южное Медведково", 
        "Бибирево", 
        "Отрадное"
    ]
}"""
print(json.loads(a))